---
kind: method
id: M:Autodesk.Revit.DB.Frame.Dispose
source: html/01664e31-f00c-d00b-4b5a-ae563a69e73b.htm
---
# Autodesk.Revit.DB.Frame.Dispose Method

Releases all resources used by the Frame

## Syntax (C#)
```csharp
public void Dispose()
```